---
kind: property
id: P:Autodesk.Revit.DB.TessellatedFace.MaterialId
source: html/0cc38de7-415d-a626-ccf7-bb100c3053a0.htm
---
# Autodesk.Revit.DB.TessellatedFace.MaterialId Property

Material of the face.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null